app/controllers/cadets_controller.rb

SELECT * FROM "cadets" WHERE ("cadets".user_id = 2 AND ("cadets"."discharged" = 'f'))
---
  def index
    #Gets all cadets for the current user & assign the ammount per month to an instance variable.
    @cadets = current_user.cadets.sort_by { |c| c.surname }

    #Instance variable of all cadets not discharged.
    @current_cadets = current_user.cadets.find(:all, :conditions => {:discharged => false}).sort_by { |c| c.surname }

INSERT INTO "cadets" ("updated_at", "firstname", "discharged", "user_id", "date_added", "surname", "standing_order", "email", "created_at") VALUES('2009-02-25 11:35:56', 'Martin', 'f', 1, '2009-02-25 11:35:00', 'Jones', 't', 'danny@thescri.be', '2009-02-25 11:35:56')
---
  def create
    #Creates a new cadet for the user from :params.
    @cadet = current_user.cadets.new(params[:cadet])
    if @cadet.save

UPDATE "cadets" SET "discharged" = 't', "standing_order" = 'f', "updated_at" = '2009-02-25 16:09:03' WHERE "id" = 7
---
  def update
    @cadet = current_cadet
    if @cadet.update_attributes(params[:cadet])

DELETE FROM "cadets" WHERE "id" = 4
---
  def destroy
    @cadet = current_cadet
    @cadet.destroy