app/controllers/inspection_controller.rb

  def create
    #looks at the params hash and creates new inspections for each cadet record.
    ok = true
    params[:cadet_score].each do |id,score|
      insp = Cadet.find(id).inspections.new(:date => Date.today, :score => score)
      (insp.authorized_absent = params[:cadet_aa].include?(id) ? true : false) unless params[:cadet_aa].nil?
      ok = insp.save! && !ok ? true : false
---
SELECT * FROM "cadets" WHERE ("cadets"."id" = 13)
SELECT * FROM "inspections" WHERE ("inspections".cadet_id = 13)
INSERT INTO "inspections" ("score", "authorized_absent", "updated_at", "date", "cadet_id", "created_at") VALUES(0, 't', '2009-03-18 11:34:07', '2009-03-18', 6, '2009-03-18 11:34:07')