app/controllers/payment_controller.rb

SELECT * FROM "cadets" WHERE ("cadets"."id" = 11)
INSERT INTO "payments" ("updated_at", "date", "ammount", "cadet_id", "created_at") VALUES('2009-02-26 23:44:10', '2009-02-26 23:44:10', -3.7, 9, '2009-02-26 23:44:10')
UPDATE "cadets" SET "balance" = -20.4, "updated_at" = '2009-04-03 19:41:21' WHERE "id" = 9
---
  def create
    ok = false
    params.each { |key, val|
      if (key.to_i > 0) #If the payment is standing order (.to_i will return 0 for all non numeric values of key)
        logger.debug "Cadet ID #{key.to_i} is paying #{val.to_f}by SO today."
        @payment = Payment.new
        @payment.cadet_id = key.to_i
        @payment.ammount = val.to_f
        @payment.date = DateTime.now
        @cadet = Cadet.find(@payment.cadet_id)
        @cadet.balance += @payment.ammount
        ok = true if @cadet.save && @payment.save