app/controllers/sessions_controller.rb

  def create
    #Authenticates user with login detailsfrom form.
    user = User.authenticate(params[:login], params[:password])
    if user
      session[:user_id] = user.id #Sets user_id in the session hash so it can be reused.
      flash[:notice] = "Welcome to inspectr. Please email any comments or suggestions to <a href=\"mailto:danny@thescri.be\">danny@thescri.be</a>." #default flash message

      change = adjust_balances_if_monthchange(user) #See private methods, below.

      flash[:notice] = "Welcome to inspectr. All current cadet's balances have been decreased by #{help.pluralize(change, 'month')}." if change > 0
      user.last_login = DateTime.now; user.save! #Update the lastlogin time
---
UPDATE "users" SET "last_login" = '2009-04-03 19:41:06', "updated_at" = '2009-04-03 19:41:06' WHERE "id" = 2