app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login", "updated_at", "username", "password_salt", "amount_per_month", "password_hash", "email", "created_at", "login_attempts") VALUES('2009-02-26 20:01:27', '2009-03-19 20:46:06', '666', '8b788ac15278e644ef578e4b946211523dc0e47c', 6.0, '7e0eb015c4abd23744e4022ced15f54f6d08a02b', 'devil@aircadets.org', '2009-03-19 20:46:06', 0)